{
  "meta": {
    "description": "This portfolio website operates as a place for me to experiment with cutting-edge technologies as a front-end engineer and showcase my projects.",
    "locale": "en_US"
  },
  "menu": {
    "/": "/",
    "/about": "/about",
    "/experience": "/experience",
    "/gallery": "/gallery",
    "/works": "/works"
  },
  "about": {
    "status": {
      "fullName": "Yuta Okuma",
      "organization": "Gakken LEAP Co.,Ltd",
      "location": "Tokyo, Japan",
      "website": "https://bear29ers.com",
      "links": "Links",
      "favoriteTeams": "Favorite Teams"
    },
    "biography": {
      "greeting": "Hi, there,",
      "occupation": "I'm a front-end developer and designer!!",
      "paragraph": {
        "first": "Hi, I'm Yuta Okuma, a front-end developer and designer with a passion for creating beautiful, functional, and user-centered digital experiences.",
        "second": "I played baseball for about 9 years as a child, and now I just enjoy watching it. My favorite teams are the Los Angeles Dodgers and the New York Yankees.",
        "third": "I first encountered video production in high school when I was active in the Japanese taiko drumming culb and began making simple video works, which I decided to study video in earnest.",
        "fourth": "I lived in Chiba until I graduated from high school and moved to Kyoto for university, where I majored in the contents business at the faculty of Image Arts and Sciences while independently producing animated videos using Adobe AfterEffects.",
        "fifth": "In 2017, I took a leave of absence from university to study abroad in Toronto, Canada for about a year. This was a very meaningful time and also the most enjoyable year of my life.",
        "sixth": "Gradually became interested in programming through the influence of a friend of mine that I met at one of my internships and started learning on my own from front-end languages. started my career as a developer in 2020 and now I am working as a front-end developer in Tokyo."
      }
    },
    "ambitions": {
      "first": "💻 Learn higher level of Next.js and master Three.js.",
      "second": "👬 Collaborate with other digital content creators.",
      "third": "📝 Obtain qualifications in several engineering fields.",
      "fourth": "🏋🏻 Lose weight and stay healthy."
    }
  }
}
