{
  "meta": {
    "description": "このポートフォリオウェブサイトは、私がフロントエンドエンジニアとして最先端の技術を試し、自分のプロジェクトを紹介する場所として運用しています。",
    "locale": "ja_JP"
  },
  "menu": {
    "/": "/ja",
    "/about": "/ja/about",
    "/experience": "/ja/experience",
    "/gallery": "/ja/gallery",
    "/works": "/ja/works"
  },
  "about": {
    "status": {
      "fullName": "大熊 悠太",
      "organization": "株式会社Gakken LEAP",
      "location": "日本, 東京",
      "website": "https://bear29ers.com",
      "links": "リンク",
      "favoriteTeams": "好きなチーム"
    },
    "biography": {
      "greeting": "こんにちは",
      "occupation": "フロントエンドエンジニアとデザイナーをしています！",
      "paragraph": {
        "first": "こんにちは、フロントエンドエンジニアとデザイナーをしている大熊悠太です。美しく機能的でユーザーに寄り添ったUX・UIを生み出すことがとても好きです。",
        "second": "少年時代に9年間ほど野球をやっていて、今では観る専門で楽しんでいます。好きなチームはロサンゼルス・ドジャースとニューヨーク・ヤンキースです。",
        "third": "高校生時代に和太鼓部で活動していた中で映像制作に出会い、簡単な映像作品を作り始めたのをきっかけに本格的に映像を学ぼうと思いました。",
        "fourth": "高校卒業まで千葉県に住んでいましたが、大学入学で京都に移り、映像学部でコンテンツビジネスを専攻しながら、Adobe AfterEffectsを使ってアニメーション動画を自主制作していました。",
        "fifth": "2017年、大学を休学し、カナダのトロントに約1年間留学しました。この留学はとても有意義な時間であり、人生の中で最も楽しい1年でした。",
        "sixth": "大学時代のインターンシップ先で知り合った友人の影響で徐々にプログラミングに興味を持ち、独学でフロントエンド言語を学び始めました。2020年にエンジニアとしてのキャリアをスタートし、現在は東京でフロントエンドエンジニアとして働いています。"
      }
    },
    "ambitions": {
      "first": "💻 Next.jsの理解を深め、Three.jsをマスターする。",
      "second": "👬 他のクリエイターとコラボレーションする。",
      "third": "📝 エンジニア領域の資格を取得する。",
      "fourth": "🏋🏻 ダイエットと健康維持を行う。"
    }
  },
  "experience": {
    "highlights": "ハイライト",
    "role": {
      "frontend": "フロントエンドエンジニア",
      "webdev_designer": "Webエンジニア & デザイナー",
      "mentor": "メンター, インターシップ"
    },
    "company": {
      "gakkenLeap": "株式会社Gakken LEAP",
      "emoshu": "株式会社EMoshU",
      "lifeIsTech": "ライフイズテック株式会社"
    },
    "location": { "tokyo": "東京, 日本", "osaka": "大阪, 日本" },
    "description": {
      "gakkenLeap": {
        "1": [
          "自身のバックグラウンドを含めてもともと教育事業にとても興味があったため、教育サービスを開発できる環境に身を置きたいと考えていた。また、自分の専門分野をさらに伸ばすためにフロントエンジニアとして働ける会社を選んだ。",
          "社会人向けスキルアップサービスのフロントエンド開発を主にVue.jsとNuxt.jsを使って担当し、デザイナーとコミュニケーションを取りながらUI/UXの改善を行った。",
          "加えて、参考資料が少ないNuxt.jsでの開発において何度も調査・検証を繰り返すことで、短期間で急速にフロントエンドのスキルを習得することができた。"
        ],
        "2": [
          "小中学生向けの既存サービスに参画し、バックエンドエンジニアと2人で開発を担当し、保守・運用を中心にしながらサービスの改善に取り組んでいる。",
          "現在抱えている問題として、フロントエンドテストの基盤が確率されておらず、パッケージのバージョンが古くなっていることが挙げられる。"
        ]
      },
      "emoshu": {
        "1": [
          "入社当時はWeb関連の仕事がなかったため、CTOの下でiOS開発を手伝うことからスタートした。当時は取締役2人、インターンが1人のみで、オフィスは古いアパートの一室だった。",
          "クライアント案件に携わりながら、社内業務にも大きく貢献し、新規ブログサイトの構築、社内ツールの開発、新規アプリの立ち上げ・リリースを経験した。エンジニアとしての業務に加え、社内コミュニケーションツールやドキュメントの開発、イベント企画や勉強会の開催、インターン生のサポート、社内プロジェクトのマネジメントなど、多岐にわたる業務を経験した。",
          "社員一人ひとりの意見が聞き入れられる社風だったため、会社のWebサイトの改善やアプリの新機能などについて自分なりの意見を出し、議論の末に会社の方針として実際に決定するなど、どんな場面でも強い責任感を持って業務を進めることができた。"
        ]
      },
      "lifeIsTech": {
        "1": [
          "中高生の新たな機会を創り出したいという思いに共感し、メンターとして参加し、主に動画編集コースを担当した。",
          "中高生にIT技術を体験する機会を提供するため、拠点とする関西だけでなく、東京や福岡など各地の大学で開催されるITキャンプイベントにメンターとして多く参加した。",
          "メンターとしてだけではなく、いくつかのキャンプではカメラマンとして参加し、楽しんでいる学生たちの写真を撮りイベント全体を盛り上げた。",
          "中高生はそれぞれ性格や熱意、スキルが異なるため、インターンシップ中にカリキュラムを組み立て、学生一人ひとりとコミュニケーションをとる方法について多くのことを学んだ。"
        ]
      }
    },
    "highlightList": {
      "gakkenLeap": {
        "1": [
          "Nuxt.jsでのプロキシ実装",
          "サーバーサイドレンダリングの習得",
          "UI/UXの改善のためのデザイナーとのコミュニケーション"
        ],
        "2": ["Next.jsを12から14へアップグレード", "フロントエンドテストの基礎"]
      },
      "emoshu": {
        "1": ["LaravelとCakePHPを使ったCMS作成", "GSAPを使った要素のアニメーション", "Adobe XDでのUIデザイン作成"]
      },
      "lifeIsTech": {
        "1": ["映像編集技術の向上", "デザイン & フォトグラフ", "PhotoshopとIllustratorでのデザイン"]
      }
    }
  }
}
